АлогистикТест2/src/Documents/алк_ПеремещениеЗапасов/алк_ПеремещениеЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ПеремещениеЗапасов</name>
  <registerRecords>AccumulationRegister.алк_ОстаткиНезавершенногоПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизацииСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыКПоступлениюНаСкладыСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ДокументыПоследовательностиПродукция</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыОрганизации</registerRecords>
  <registerRecords>AccumulationRegister.алк_ЗапасыНаСкладахСерии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <registerRecords>InformationRegister.СерийныеНомераГарантии</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЛесопродукции</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.алк_ВидыОперацийПеремещениеЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаПолучатель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Штабель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтабельПолучатель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаПолучатель</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныеНомера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПакетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСерии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентифицирован</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодПакетаГод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСостав</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СерийныеНомера</name>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыНоменклатуры</name>
    <attributes>
      <name>ВидНоменклатуры</name>
      <type>
        <types>CatalogRef.КатегорииНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/AccumulationRegisters/алк_ЗапасыКПоступлениюНаСкладыСерии/алк_ЗапасыКПоступлениюНаСкладыСерии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ЗапасыКПоступлениюНаСкладыСерии</name>
  <resources>
    <name>КоличествоПакетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/InformationRegisters/алк_ПараметрыПакетов/алк_ПараметрыПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПараметрыПакетов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НомерПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодПакета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоСостав</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>СертификатFSC</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбъемТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесБруттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодУпаковки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>БоковаяДоска</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </resources>
  <resources>
    <name>Габарит</name>
    <type>
      <types>EnumRef.алк_ГабаритПакета</types>
    </type>
  </resources>
  <resources>
    <name>КатегорияНоменклатурыПЭО</name>
    <type>
      <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
    </type>
  </resources>
  <resources>
    <name>Сухой</name>
    <comment>Для пакетов СП</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Припуск</name>
    <type>
      <types>CatalogRef.алк_ВариантыПрипуска</types>
    </type>
  </resources>
  <resources>
    <name>ПризнакНЗП</name>
    <type>
      <types>EnumRef.алк_ПризнакНЗП</types>
    </type>
  </resources>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/AccumulationRegisters/алк_ОстаткиЗапасов/алк_ОстаткиЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ОстаткиЗапасов</name>
  <resources>
    <name>Количество</name>
    <comment>Для пиловочника и пилмата это объем, для ДГ это вес</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штабель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/InformationRegisters/алк_ПараметрыХарактеристик/алк_ПараметрыХарактеристик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПараметрыХарактеристик</name>
  <resources>
    <name>Порода</name>
    <type>
      <types>CatalogRef.Породы</types>
    </type>
  </resources>
  <resources>
    <name>Сорт</name>
    <type>
      <types>CatalogRef.Сорта</types>
    </type>
  </resources>
  <resources>
    <name>Длина</name>
    <type>
      <types>CatalogRef.Длины</types>
    </type>
  </resources>
  <resources>
    <name>Сечение</name>
    <type>
      <types>CatalogRef.РазмерСечения</types>
    </type>
  </resources>
  <resources>
    <name>Поверхность</name>
    <type>
      <types>CatalogRef.Поверхности</types>
    </type>
  </resources>
  <resources>
    <name>Влажность</name>
    <type>
      <types>CatalogRef.Влажность</types>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <comment>Расчетный объем одной штуки исходя из размера. Заполняется при записи набора</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КоличествоРеквизитов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/AccumulationRegisters/алк_ПакетыВСушильныхКамерах/алк_ПакетыВСушильныхКамерах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ПакетыВСушильныхКамерах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СушильнаяКамера</name>
    <type>
      <types>CatalogRef.алк_СушильныеКамеры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/Enums/алк_НаправленияДеятельности/алк_НаправленияДеятельности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_НаправленияДеятельности</name>
  <enumValues>
    <name>ДревесныеГранулы</name>
  </enumValues>
  <enumValues>
    <name>Лесопиление</name>
  </enumValues>
  <enumValues>
    <name>Отходы</name>
  </enumValues>
  <enumValues>
    <name>МалоеЛесопиление</name>
  </enumValues>
  <enumValues>
    <name>Шпон</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Enums/алк_ТипСклада/алк_ТипСклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ТипСклада</name>
  <enumValues>
    <name>СГП</name>
  </enumValues>
  <enumValues>
    <name>Биржа</name>
  </enumValues>
  <enumValues>
    <name>Порт</name>
  </enumValues>
  <enumValues>
    <name>Производство</name>
  </enumValues>
  <enumValues>
    <name>СушильныйКомплекс</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/алк_ПеремещениеЗапасов/Forms/ФормаДокумента/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);
	
	
	Если Пользователи.ТекущийПользователь().Наименование = "Администратор РФП" Тогда  
		Элементы.ЗапасыЗаполнитьПоОстаткамНаСушке.Видимость = Истина;	
	КонецЕсли; 
	
	Если Объект.Направление = Перечисления.алк_НаправленияДеятельности.ДревесныеГранулы Тогда 
		
		Если Объект.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.Перемещение Тогда 
			
			СкладыСтруктура = РфпСервер.ПолучитьСкладыДГ(Объект.Дата);
									
			ЭтаФорма.Элементы.СтруктурнаяЕдиницаПолучатель.ТолькоПросмотр = Ложь;   			
			ЭтаФорма.Элементы.СтруктурнаяЕдиницаПолучатель.РежимВыбораИзСписка = Истина;
			
			ЭтаФорма.Элементы.СтруктурнаяЕдиница.ТолькоПросмотр = Ложь;   			
			ЭтаФорма.Элементы.СтруктурнаяЕдиница.РежимВыбораИзСписка = Истина;
			
			ЭтаФорма.Элементы.СтруктурнаяЕдиницаПолучатель.СписокВыбора.Очистить();
			ЭтаФорма.Элементы.СтруктурнаяЕдиница.СписокВыбора.Очистить();

			й = 0;
			Для Каждого ЭлСтруктуры из СкладыСтруктура цикл 				
				ЭтаФорма.Элементы.СтруктурнаяЕдиницаПолучатель.СписокВыбора.Вставить(й, ЭлСтруктуры.Значение); 
				ЭтаФорма.Элементы.СтруктурнаяЕдиница.СписокВыбора.Вставить(й, ЭлСтруктуры.Значение); 
				й = й + 1;
			КонецЦикла;  	
			
		КонецЕсли;
		
	КонецЕсли;   
	
	УчастокПриИзмененииНаСервере();

		      	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МассивСписка = Новый Массив;
	Для каждого стр Из Объект.ВидыНоменклатуры Цикл
		МассивСписка.Добавить(стр.ВидНоменклатуры);	
	КонецЦикла; 
	СписокНоменклатуры.ЗагрузитьЗначения(МассивСписка);
	Множественность = ?(СписокНоменклатуры.Количество()=1, Ложь, Истина);
	//НастроитьТаблицуПоСпискуНоменклатуры();
	
	Если Объект.Направление = ПредопределенноеЗначение("Перечисление.алк_НаправленияДеятельности.ДревесныеГранулы") Тогда
		//Элементы.ЗапасыЗаполнитьПоОстаткамНаСкладе.Видимость = Ложь;
	Иначе		
		Элементы.ЗапасыЗаполнитьПоОстаткамНаСкладе.Видимость = Не Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.алк_ВидыОперацийПеремещениеЗапасов.ПередачаССушки"); 			
	КонецЕсли; 
	
	ТолькоСухие = Истина; 
	
	//заполняем список выбора с годами  
	Если ЗначениеЗаполнено(Объект.Дата) Тогда 
		ГодПоДоку = НачалоГода(Объект.Дата);
	Иначе 
		ГодПоДоку = НачалоГода(ТекущаяДата());
	КонецЕсли;

	Элементы.ЗапасыПериодПакетаГод.СписокВыбора.Добавить(Формат(ДобавитьМесяц(ГодПоДоку,-12),"ДФ=yyyy"),Формат(ДобавитьМесяц(ГодПоДоку,-12),"ДФ=yyyy")); 
	Элементы.ЗапасыПериодПакетаГод.СписокВыбора.Добавить(Формат(ДобавитьМесяц(ГодПоДоку,-24),"ДФ=yyyy"),Формат(ДобавитьМесяц(ГодПоДоку,-24),"ДФ=yyyy")); 
	Элементы.ЗапасыПериодПакетаГод.СписокВыбора.Добавить(Формат(ДобавитьМесяц(ГодПоДоку,-36),"ДФ=yyyy"),Формат(ДобавитьМесяц(ГодПоДоку,-36),"ДФ=yyyy"));
	//\\
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	СинхронизироватьСписокИТаблицу();
	
	//ПараметрыОтбора = Новый Структура("Идентифицирован", Ложь);
	//МассивСтрок = Объект.Запасы.НайтиСтроки(ПараметрыОтбора);
	//Если МассивСтрок.Количество() > 0 Тогда
	//	СтрокиКУдалению = Новый Массив;
	//	Для каждого стр Из МассивСтрок Цикл
	//		СтрокиКУдалению.Добавить(стр);	
	//	КонецЦикла; 		
	//	
	//	Режим = РежимДиалогаВопрос.ДаНет;
	//	Оповещение = Новый ОписаниеОповещения("ВопросНеидентифицированныеСтроки", ЭтаФорма);
	//	ПоказатьВопрос(Оповещение, "В табличной части ""Запасы"" имеются строки,
	//	| с неидентифицированными пакетами." + Символы.ПС +
	//	"Удалить эти строки?", Режим, 0, ,"");
	//КонецЕсли; 
	
КонецПроцедуры


#КонецОбласти 


#Область СобытияЭлементов

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	ВидОперацииПриИзмененииНаСервере();
	//Объект.Запасы.Очистить();	
КонецПроцедуры

&НаСервере
Процедура ВидОперацииПриИзмененииНаСервере()
	
	// Нач мод [Пакушев И.С.] [13.12.2018] 
	// Обращение № [0000097400] [переработано]
	// Было
	// Стало 
	
	ЭтаФорма.Элементы.СтруктурнаяЕдиницаПолучатель.ТолькоПросмотр = Истина; 
	ЭтаФорма.Элементы.СтруктурнаяЕдиницаПолучатель.РежимВыбораИзСписка = Ложь;
	
	ЭтаФорма.Элементы.СтруктурнаяЕдиница.ТолькоПросмотр = Истина; 
	ЭтаФорма.Элементы.СтруктурнаяЕдиница.РежимВыбораИзСписка = Ложь;
	
	Если Объект.Направление = Перечисления.алк_НаправленияДеятельности.МалоеЛесопиление Тогда
		
		Если Объект.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаИзПроизводства Тогда
			
			Объект.СтруктурнаяЕдиница           = Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000060"); // Участок МЛП		
			Объект.СтруктурнаяЕдиницаПолучатель = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;	//Склад готовой продукции
			
		ИначеЕсли Объект.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ВозвратНаПроизводство Тогда
			
			Объект.СтруктурнаяЕдиница           = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;	//Склад готовой продукции
			Объект.СтруктурнаяЕдиницаПолучатель = Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000060"); // Участок МЛП
			
		Иначе
			
			Объект.СтруктурнаяЕдиница           = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();	
			Объект.СтруктурнаяЕдиницаПолучатель = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
			ЭтаФорма.Элементы.СтруктурнаяЕдиницаПолучатель.ТолькоПросмотр = Ложь;		
			ЭтаФорма.Элементы.СтруктурнаяЕдиница.ТолькоПросмотр = Ложь; 
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Объект.Направление = Перечисления.алк_НаправленияДеятельности.Лесопиление Тогда
		
		ПиломатериалСП = Справочники.КатегорииНоменклатуры.НайтиПоКоду("00-000011");
		
		Если Объект.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаИзПроизводства_УПП Тогда 
			
			Объект.СтруктурнаяЕдиница  = Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000092"); //Буферный склад малой пересортировки
			Объект.СтруктурнаяЕдиницаПолучатель = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;	//Склад готовой продукции
			
			ДатаВводаШтабеляНаСГП = Константы.алк_ДатаВводаШтабеляНаСГП.Получить();
			
			Если ЗначениеЗаполнено(ДатаВводаШтабеляНаСГП) И ТекущаяДата() > ДатаВводаШтабеляНаСГП Тогда
				Объект.ШтабельПолучатель		= Справочники.алк_Штабели.НайтиПоКоду("000000012");	//Участок приемки на СГП
				Объект.Штабель					= Справочники.алк_Штабели.ПустаяСсылка();
			КонецЕсли; 		
			
		ИначеЕсли Объект.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаИзПроизводства_УРП_СГП Тогда   
			
			Объект.СтруктурнаяЕдиница  = Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000107"); //Участок ручной пересортировки
			Объект.СтруктурнаяЕдиницаПолучатель = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;	//Склад готовой продукции
			
			ДатаВводаШтабеляНаСГП = Константы.алк_ДатаВводаШтабеляНаСГП.Получить();
			
			Если ЗначениеЗаполнено(ДатаВводаШтабеляНаСГП) И ТекущаяДата() > ДатаВводаШтабеляНаСГП Тогда
				Объект.ШтабельПолучатель		= Справочники.алк_Штабели.НайтиПоКоду("000000012");	//Участок приемки на СГП
				Объект.Штабель					= Справочники.алк_Штабели.ПустаяСсылка();
			КонецЕсли; 	
			
		ИначеЕсли Объект.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаИзПроизводства_УРП_Магазин Тогда   
			
			Объект.СтруктурнаяЕдиница  = Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000107"); //Участок ручной пересортировки
			Объект.СтруктурнаяЕдиницаПолучатель = Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000106");	//Склад-магаазин  ПБ-000106
					
		ИначеЕсли Объект.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаИзПроизводства Тогда 		
			
			Объект.СтруктурнаяЕдиница  = РфпПолучениеДанныхСервер.ОбъектДанных(Справочники.алк_ВидыОбъектов.БуферныйСкладЦЛП); 		                                                                                                                           	
			Объект.СтруктурнаяЕдиницаПолучатель = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;	//Склад готовой продукции
			
			ДатаВводаШтабеляНаСГП = Константы.алк_ДатаВводаШтабеляНаСГП.Получить();
			
			Если ЗначениеЗаполнено(ДатаВводаШтабеляНаСГП) И ТекущаяДата() > ДатаВводаШтабеляНаСГП Тогда
				Объект.ШтабельПолучатель		= Справочники.алк_Штабели.НайтиПоКоду("000000012");	//Участок приемки на СГП
				Объект.Штабель					= Справочники.алк_Штабели.ПустаяСсылка();
			КонецЕсли;
		ИначеЕсли Объект.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПриемкаНаСГП Тогда
			
			Объект.СтруктурнаяЕдиница           = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;	//Склад готовой продукции
			Объект.Штабель						= Справочники.алк_Штабели.НайтиПоКоду("000000012");	//Участок приемки на СГП
			Объект.ШтабельПолучатель			= Справочники.алк_Штабели.ПустаяСсылка();
			Объект.СтруктурнаяЕдиницаПолучатель = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;	//Склад готовой продукции	
			
		ИначеЕсли Объект.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ВозвратНаПроизводство Тогда
			
			Объект.СтруктурнаяЕдиница           = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;	//Склад готовой продукции
			Объект.СтруктурнаяЕдиницаПолучатель = РфпПолучениеДанныхСервер.ОбъектДанных(Справочники.алк_ВидыОбъектов.БуферныйСкладЦЛП);
			
		ИначеЕсли Объект.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаСПереупаковки Тогда
			
			Объект.СтруктурнаяЕдиница           = РфпПолучениеДанныхСервер.ОбъектДанных(Справочники.алк_ВидыОбъектов.УчастокПереупаковкиСГП);
			Объект.СтруктурнаяЕдиницаПолучатель = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;	//Склад готовой продукции						
			
		ИначеЕсли Объект.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаНаПереупаковку Тогда
			
			Объект.СтруктурнаяЕдиница           = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;	//Склад готовой продукции
			Объект.СтруктурнаяЕдиницаПолучатель	= РфпПолучениеДанныхСервер.ОбъектДанных(Справочники.алк_ВидыОбъектов.УчастокПереупаковкиСГП);
			
		ИначеЕсли Объект.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаНаСушку Тогда
			
			Объект.СтруктурнаяЕдиница           = РфпПолучениеДанныхСервер.ОбъектДанных(Справочники.алк_ВидыОбъектов.БуферныйСкладЦЛП);
			Объект.СтруктурнаяЕдиницаПолучатель	= Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000031"); // Сушильный комплекс
			
			//Дубоделов Э.А 07.06.2023
			//Дублировались номенклатуры в поле
			Если СписокНоменклатуры.НайтиПоЗначению(ПиломатериалСП) = Неопределено Тогда
				СписокНоменклатуры.Добавить(Справочники.КатегорииНоменклатуры.НайтиПоКоду("00-000011"),"Пиломатериал(СП)", Истина); // Пиломатериал(СП)
			КонецЕсли;
			//Дубоделов Э.А 07.06.2023
			
		ИначеЕсли Объект.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаССушки Тогда
			
			Объект.СтруктурнаяЕдиница           = Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000031"); // Сушильный комплекс
			Объект.СтруктурнаяЕдиницаПолучатель	= РфпПолучениеДанныхСервер.ОбъектДанных(Справочники.алк_ВидыОбъектов.БуферныйСкладЦЛП);
			
			//Дубоделов Э.А 07.06.2023
			//Дублировались номенклатуры в поле
			Если СписокНоменклатуры.НайтиПоЗначению(ПиломатериалСП) = Неопределено Тогда
				СписокНоменклатуры.Добавить(Справочники.КатегорииНоменклатуры.НайтиПоКоду("00-000011"),"Пиломатериал(СП)", Истина); // Пиломатериал(СП)
			КонецЕсли;
			//Дубоделов Э.А 07.06.2023
			
		ИначеЕсли Объект.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаВНезавершенноеПроизводство Тогда
			
			Объект.СтруктурнаяЕдиница           = РфпПолучениеДанныхСервер.ОбъектДанных(Справочники.алк_ВидыОбъектов.БуферныйСкладЦЛП);
			Объект.СтруктурнаяЕдиницаПолучатель	= Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000061"); // Незавершенное производство (ПМ)
			//СписокНоменклатуры.Добавить(Справочники.КатегорииНоменклатуры.НайтиПоКоду("00-000011"),"Пиломатериал", Истина); // Пиломатериал(СП)
			
		ИначеЕсли Объект.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаСНезавершенногоПроизводства Тогда
			
			Объект.СтруктурнаяЕдиница           = Справочники.СтруктурныеЕдиницы.НайтиПоКоду("ПБ-000061"); // Незавершенное производство (ПМ)
			Объект.СтруктурнаяЕдиницаПолучатель	= РфпПолучениеДанныхСервер.ОбъектДанных(Справочники.алк_ВидыОбъектов.БуферныйСкладЦЛП);
			//СписокНоменклатуры.Добавить(Справочники.КатегорииНоменклатуры.НайтиПоКоду("00-000011"),"Пиломатериал", Истина); // Пиломатериал(СП)
			
		Иначе
			
			Объект.СтруктурнаяЕдиница           = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();	
			Объект.СтруктурнаяЕдиницаПолучатель = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
			ЭтаФорма.Элементы.СтруктурнаяЕдиницаПолучатель.ТолькоПросмотр = Ложь;		
			ЭтаФорма.Элементы.СтруктурнаяЕдиница.ТолькоПросмотр = Ложь;
			
		КонецЕсли; 
		
		Если Не Объект.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПриемкаНаСГП Тогда					
			Объект.Штабель	= Справочники.алк_Штабели.ПустаяСсылка(); 	
		КонецЕсли;
		
		Если Не Объект.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаИзПроизводства
			И Не Объект.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаИзПроизводства_УПП 
			И Не Объект.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаИзПроизводства_УРП_СГП Тогда			
			Объект.ШтабельПолучатель	= Справочники.алк_Штабели.ПустаяСсылка();				
		КонецЕсли;
		
		
	КонецЕсли; 
	
	Если Объект.Направление = Перечисления.алк_НаправленияДеятельности.Отходы Тогда
		
		Если Объект.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаИзПроизводства Тогда
			
			Объект.СтруктурнаяЕдиница           = РфпПолучениеДанныхСервер.ОбъектДанных(Справочники.алк_ВидыОбъектов.УчастокСборкиОтходов);
			Объект.СтруктурнаяЕдиницаПолучатель = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;	//Склад готовой продукции
			
		ИначеЕсли Объект.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ВозвратНаПроизводство Тогда
			
			Объект.СтруктурнаяЕдиница           = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;	//Склад готовой продукции
			Объект.СтруктурнаяЕдиницаПолучатель = РфпПолучениеДанныхСервер.ОбъектДанных(Справочники.алк_ВидыОбъектов.УчастокСборкиОтходов);
			
		ИначеЕсли Объект.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаСПереупаковки Тогда
			
			Объект.СтруктурнаяЕдиница           = РфпПолучениеДанныхСервер.ОбъектДанных(Справочники.алк_ВидыОбъектов.УчастокПереупаковкиСГП);
			Объект.СтруктурнаяЕдиницаПолучатель = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;	//Склад готовой продукции						
			
		ИначеЕсли Объект.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаНаПереупаковку Тогда
			
			Объект.СтруктурнаяЕдиница           = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;	//Склад готовой продукции
			Объект.СтруктурнаяЕдиницаПолучатель	= РфпПолучениеДанныхСервер.ОбъектДанных(Справочники.алк_ВидыОбъектов.УчастокПереупаковкиСГП);
			
		ИначеЕсли Объект.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.Перемещение Тогда	
			
			ЭтаФорма.Элементы.СтруктурнаяЕдиницаПолучатель.ТолькоПросмотр = Ложь; 
			ЭтаФорма.Элементы.СтруктурнаяЕдиницаПолучатель.РежимВыбораИзСписка = Истина;
			
			ЭтаФорма.Элементы.СтруктурнаяЕдиницаПолучатель.СписокВыбора.Очистить();
					
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	СтруктурныеЕдиницы.Ссылка
				|ИЗ
				|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
				|ГДЕ
				|	СтруктурныеЕдиницы.алк_ТипСклада = ЗНАЧЕНИЕ(Перечисление.алк_ТипСклада.СГП)";
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			й = 0;
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ЭтаФорма.Элементы.СтруктурнаяЕдиницаПолучатель.СписокВыбора.Вставить(й, ВыборкаДетальныеЗаписи.Ссылка);
				й = й + 1;
			КонецЦикла;	
			
			Объект.СтруктурнаяЕдиница           = Справочники.СтруктурныеЕдиницы.ОсновнойСклад;	//Склад готовой продукции
		Иначе
			
			Объект.СтруктурнаяЕдиница           = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();	
			Объект.СтруктурнаяЕдиницаПолучатель = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
			ЭтаФорма.Элементы.СтруктурнаяЕдиницаПолучатель.ТолькоПросмотр = Ложь;		
			ЭтаФорма.Элементы.СтруктурнаяЕдиница.ТолькоПросмотр = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Объект.Направление = Перечисления.алк_НаправленияДеятельности.ДревесныеГранулы Тогда
		
		СкладыСтруктура = РфпСервер.ПолучитьСкладыДГ(Объект.Дата);
	
		Если Объект.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаИзПроизводства Тогда 			
			
			Объект.СтруктурнаяЕдиница           = СкладыСтруктура.ДГ_Производство; // ДГ Производство
			Объект.СтруктурнаяЕдиницаПолучатель = СкладыСтруктура.ДГ_СГП; // ДГ СГП
			
		ИначеЕсли Объект.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.Перемещение Тогда 
			
			Объект.СтруктурнаяЕдиница           = СкладыСтруктура.ДГ_СГП; // ДГ СГП
			
			ЭтаФорма.Элементы.СтруктурнаяЕдиницаПолучатель.ТолькоПросмотр = Ложь;   			
			ЭтаФорма.Элементы.СтруктурнаяЕдиницаПолучатель.РежимВыбораИзСписка = Истина;
			
			ЭтаФорма.Элементы.СтруктурнаяЕдиница.ТолькоПросмотр = Ложь;   			
			ЭтаФорма.Элементы.СтруктурнаяЕдиница.РежимВыбораИзСписка = Истина;
			
			ЭтаФорма.Элементы.СтруктурнаяЕдиницаПолучатель.СписокВыбора.Очистить();
			ЭтаФорма.Элементы.СтруктурнаяЕдиница.СписокВыбора.Очистить();

			й = 0;
			Для Каждого ЭлСтруктуры из СкладыСтруктура цикл 				
				ЭтаФорма.Элементы.СтруктурнаяЕдиницаПолучатель.СписокВыбора.Вставить(й, ЭлСтруктуры.Значение); 
				ЭтаФорма.Элементы.СтруктурнаяЕдиница.СписокВыбора.Вставить(й, ЭлСтруктуры.Значение); 
				й = й + 1;
			КонецЦикла;  	
			
		Иначе
			
			Объект.СтруктурнаяЕдиница           = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();	
			Объект.СтруктурнаяЕдиницаПолучатель = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
			ЭтаФорма.Элементы.СтруктурнаяЕдиницаПолучатель.ТолькоПросмотр = Ложь;		
			ЭтаФорма.Элементы.СтруктурнаяЕдиница.ТолькоПросмотр = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Кон мод [Пакушев И.С.] [13.12.2018]   
	
	//++мод [Пакушев И.С.] [05.10.2023] 
	
	
	Если Объект.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаНаСушку Или
		Объект.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаССушки  Тогда 
		
		Сообщить("Данная операция не будет проведена! Документ возможно сохранить.");    
	КонецЕсли;
	
	//++

	
КонецПроцедуры

///////////////////////// Выбор видов номенклатуры из списка

&НаСервереБезКонтекста
Функция СписокНоменклатурыНачалоВыбораНаСервере(СписокНоменклатуры)
	
	СписокДляВыбора = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КатегорииНоменклатуры.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА КатегорииНоменклатуры.Ссылка В (&СписокНоменклатуры)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Пометка
	|ИЗ
	|	Справочник.КатегорииНоменклатуры КАК КатегорииНоменклатуры
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокДляВыбора.Добавить(ВыборкаДетальныеЗаписи.Ссылка,,ВыборкаДетальныеЗаписи.Пометка);		
	КонецЦикла;
	
	Возврат СписокДляВыбора;
	
КонецФункции

&НаКлиенте
Процедура СписокНоменклатурыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СписокДляВыбора = СписокНоменклатурыНачалоВыбораНаСервере(СписокНоменклатуры);
	Оповещение = Новый ОписаниеОповещения("ПослеОтметкиЭлементов", ЭтаФорма);
	СписокДляВыбора.ПоказатьОтметкуЭлементов(Оповещение, "Виды номенклатуры.");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтметкиЭлементов(СписокДляВыбора, Параметры) Экспорт
	
	Если СписокДляВыбора = Неопределено Тогда
		//Сообщить("Отказ от пометк.");
	Иначе
		СтарыйСписокНоменклатуры = СписокНоменклатуры.Скопировать();
		
		СписокНоменклатуры.Очистить();
		Для каждого Элемент Из СписокДляВыбора Цикл
			Если Элемент.Пометка Тогда
				СписокНоменклатуры.Добавить(Элемент.Значение);
			КонецЕсли;
		КонецЦикла;
		
		СписокУдаленных = Новый СписокЗначений;
		Для каждого стр Из СтарыйСписокНоменклатуры Цикл
			Если СписокНоменклатуры.НайтиПоЗначению(стр.Значение) = Неопределено Тогда
				СписокУдаленных.Добавить(стр.Значение);	
			КонецЕсли; 	
		КонецЦикла;
		
		ЛишниеСтроки = НеСоответствующиеСпискуВидов(СписокУдаленных);
		
		Если ЛишниеСтроки.Количество() > 0 Тогда
			СтрокиКУдалению = Новый Массив;
			Для каждого стрЛишниеСтроки Из ЛишниеСтроки Цикл
				СтрокиКУдалению.Добавить(стрЛишниеСтроки);	
			КонецЦикла; 
			
			Режим = РежимДиалогаВопрос.ДаНет;
			Оповещение = Новый ОписаниеОповещения("ВопросЕстьЛишниеСтроки", ЭтаФорма);
			ПоказатьВопрос(Оповещение, "В табличной части ""Продукция"" имеются строки, с номенклатурой
			| не выбранной в списке ""Виды номенклатуры""." + Символы.ПС +
			"Удалить лишние строки?", Режим, 0, ,"");
		Иначе
			СтрокиКУдалению = Неопределено;
			СинхронизироватьСписокИТаблицу();
			
			Множественность = ?(СписокНоменклатуры.Количество()=1, Ложь, Истина);
			//НастроитьТаблицуПоСпискуНоменклатуры();
			
		КонецЕсли; 	
		
	КонецЕсли;
КонецПроцедуры

//////////////////////// События табличного поля "Запасы"

&НаКлиенте
Процедура ЗапасыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если СписокНоменклатуры.Количество() = 0 Тогда
		// Сообщить о необходимости добавить вид номенклатуры
		Отказ = Истина;
		Оповещение = Новый ОписаниеОповещения("НеобходимоЗаполнитьВидНоменклатуры", ЭтаФорма);
		ПоказатьПредупреждение(Оповещение, "Необходимо указать Номенклатуру в шапке документа!",,"Не заполнены поля");	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура НеобходимоЗаполнитьВидНоменклатуры(ДополнительныеПараметры) Экспорт
	
	Возврат;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыСерийныйНомерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли; 
	
	ПрошлыйПериод = ?(ЗначениеЗаполнено(ТекДанные.ПериодПакетаГод), Истина, Ложь);
	
	// Заполнить параметры пакета
	
	НомерПакета = ТекДанные.НомерСерии;
	
	Если НомерПакета = 0 И ЗначениеЗаполнено(ТекДанные.СерийныйНомер) Тогда 		
		НомерПакета = Число(Сред(ТекДанные.СерийныйНомер,7));
		ТекДанные.НомерСерии = НомерПакета;
	КонецЕсли; 
	
	Маска = "";

	Если Объект.Направление = ПредопределенноеЗначение("Перечисление.алк_НаправленияДеятельности.Лесопиление") Тогда
		
		Если  Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.алк_ВидыОперацийПеремещениеЗапасов.ПередачаВНезавершенноеПроизводство") 
			Или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.алк_ВидыОперацийПеремещениеЗапасов.ПередачаСНезавершенногоПроизводства") Тогда
			
			Маска = "НЗ";		
			
		КонецЕсли; 
		
		Для каждого Стр Из СписокНоменклатуры Цикл 		
			Если "" + Стр = "Побочная продукция" Тогда			
				Маска = "ПП";
			КонецЕсли;  
		КонецЦикла;  
		
		
	ИначеЕсли Объект.Направление = ПредопределенноеЗначение("Перечисление.алк_НаправленияДеятельности.МалоеЛесопиление") Тогда
		
		Если  Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.алк_ВидыОперацийПеремещениеЗапасов.ПередачаНаСушку") 
			Или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.алк_ВидыОперацийПеремещениеЗапасов.ПередачаССушки") Тогда
			
			Маска = "МС";	
			
		Иначе
			
			Маска = "МЛ";
		
		КонецЕсли; 
		     	
		Для каждого Стр Из СписокНоменклатуры Цикл 		
			Если "" + Стр = "Побочная продукция" Тогда			
				Маска = "МП";
			КонецЕсли;  
		КонецЦикла; 
		        
	КонецЕсли;   
	
	//временный костыль переписать бы это все нафиг
	
	Если ЗначениеЗаполнено(ТекДанные.СерийныйНомер) Тогда 		
		Маска = Лев("" + ТекДанные.СерийныйНомер, 2); 	
	КонецЕсли;                                        	
    //
	
	
	ПараметрыПакета = РфпПолучениеДанныхСервер.ПараметрыПакетаНоменклатуры(ТекДанные.Номенклатура, НомерПакета, ?(ПрошлыйПериод, Дата(ТекДанные.ПериодПакетаГод+"0101"), ТекущаяДата()),Маска);
	ЗаполнитьЗначенияСвойств(ТекДанные, ПараметрыПакета);
	
	Если Не ЗначениеЗаполнено(ТекДанные.СерийныйНомер) Тогда 		
		ТекДанные.СерийныйНомер = ПолучитьСерийныйНомер(НомерПакета, ТекДанные.Номенклатура, Объект.ДатаСмены, Маска); 	
	КонецЕсли; 
	
	ТекДанные.КоличествоПакетов = 1;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСерийныйНомер(НомерПакета, Владелец, ДатаСмены, Маска)
	
	Значение = СтрЗаменить(Формат(НомерПакета, "ЧГ="), " ", "");
    НадоНулей = 6 - СтрДлина(Значение);
    ВедущиеНули = Формат(0,"ЧЦ="+НадоНулей+";ЧН=; ЧВН=; ЧГ=0");
    НомерПакетаСНулями =  ВедущиеНули + Значение;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СерийныеНомера.Ссылка КАК СерийныйНомер
		|ИЗ
		|	Справочник.СерийныеНомера КАК СерийныеНомера
		|ГДЕ
		|	СерийныеНомера.Владелец = &Владелец
		|	И СерийныеНомера.Наименование ПОДОБНО ""%"" + &Маска + ""-"" + &Год + ""-"" + &Номер";
	
	Запрос.УстановитьПараметр("Владелец", 	Владелец);
	Запрос.УстановитьПараметр("Маска", 		Маска); 
	Запрос.УстановитьПараметр("Год", 		Формат((ДатаСмены),"ДФ=yy"));
	Запрос.УстановитьПараметр("Номер", 		НомерПакетаСНулями);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СерийныйНомер = Справочники.СерийныеНомера.ПустаяСсылка();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		  СерийныйНомер = ВыборкаДетальныеЗаписи.СерийныйНомер;
	КонецЦикла;
	
	Возврат СерийныйНомер;

КонецФункции // ПолучитьСерийныйНомер()
 

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаСервере
Процедура ЗаполнитьПоОстаткамНаСкладеНаСервере(РезультатЗакрытия, ДопПараметры) Экспорт
	
	//Документ = РеквизитФормыВЗначение("Объект");
	//Документ.ЗаполнитьЗапасыПоОстаткамНаСкладе(СписокКатегорий);
	//ЗначениеВРеквизитФормы(Документ, "Объект"); 
	
	//Когда закрыли окно с периодом, нажав на крестик
	Если РезультатЗакрытия = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	// странный там запрос... не понял я его
			
	Запрос = Новый Запрос;
	
	Если  Объект.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаВНезавершенноеПроизводство Тогда 
			
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ЗапасыКПоступлениюНаСкладыСерииОстатки.Номенклатура,
		|	алк_ЗапасыКПоступлениюНаСкладыСерииОстатки.СерийныйНомер КАК СерийныйНомер,
		|	алк_ЗапасыКПоступлениюНаСкладыСерииОстатки.КоличествоПакетовОстаток КАК КоличествоПакетов
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрНакопления.алк_ЗапасыКПоступлениюНаСкладыСерии.Остатки(
		|			&ДатаОстатков,
		|			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|				И Номенклатура.КатегорияНоменклатуры В (&СписокКатегорий)) КАК алк_ЗапасыКПоступлениюНаСкладыСерииОстатки
		|ГДЕ
		|	алк_ЗапасыКПоступлениюНаСкладыСерииОстатки.СерийныйНомер.Наименование ПОДОБНО ""НЗ%""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Номенклатура,
		|	ВТ.СерийныйНомер,
		|	ВТ.КоличествоПакетов,
		|	алк_ПараметрыПакетовСрезПоследних.Характеристика,
		|	алк_ПараметрыПакетовСрезПоследних.КоличествоСостав,
		|	алк_ПараметрыПакетовСрезПоследних.Объем
		|ИЗ
		|	ВТ КАК ВТ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
		|				&ДатаОстатков,
		|				СерийныйНомер В
		|					(ВЫБРАТЬ
		|						ВТ.СерийныйНомер
		|					ИЗ
		|						ВТ КАК ВТ)) КАК алк_ПараметрыПакетовСрезПоследних
		|		ПО ВТ.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер";
			
	Иначе
		
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ЗапасыКПоступлениюНаСкладыСерииОстатки.Номенклатура,
		|	алк_ЗапасыКПоступлениюНаСкладыСерииОстатки.СерийныйНомер КАК СерийныйНомер,
		|	алк_ЗапасыКПоступлениюНаСкладыСерииОстатки.КоличествоПакетовОстаток КАК КоличествоПакетов
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрНакопления.алк_ЗапасыКПоступлениюНаСкладыСерии.Остатки(
		|			&ДатаОстатков,
		|			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|				И Номенклатура.КатегорияНоменклатуры В (&СписокКатегорий)) КАК алк_ЗапасыКПоступлениюНаСкладыСерииОстатки
		|ГДЕ
		|	НЕ алк_ЗапасыКПоступлениюНаСкладыСерииОстатки.СерийныйНомер.Наименование ПОДОБНО ""НЗ%""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Номенклатура,
		|	ВТ.СерийныйНомер,
		|	ВТ.КоличествоПакетов,
		|	алк_ПараметрыПакетовСрезПоследних.Характеристика,
		|	алк_ПараметрыПакетовСрезПоследних.КоличествоСостав,
		|	алк_ПараметрыПакетовСрезПоследних.Объем
		|ИЗ
		|	ВТ КАК ВТ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
		|				&ДатаОстатков,
		|				СерийныйНомер В
		|					(ВЫБРАТЬ
		|						ВТ.СерийныйНомер
		|					ИЗ
		|						ВТ КАК ВТ)) КАК алк_ПараметрыПакетовСрезПоследних
		|		ПО ВТ.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер";

	КонецЕсли;
	
	Если ЗаСмену Тогда
		
		Если  Объект.ВидОперации = Перечисления.алк_ВидыОперацийПеремещениеЗапасов.ПередачаВНезавершенноеПроизводство Тогда 
			
			Запрос.Текст = ТекстЗапросНЗП();
					
		Иначе
			
			Запрос.Текст = ТекстЗапросЗаСмену();		
		
		КонецЕсли;  	
		
		Запрос.УстановитьПараметр("ДатаСмены", 	РезультатЗакрытия.Период.ДатаСмены);
		Запрос.УстановитьПараметр("Смена", 		РезультатЗакрытия.Период.Смена);	
		Запрос.УстановитьПараметр("Направление",Объект.Направление); 
		
		//Запрос.УстановитьПараметр("ДатаНачала", 		РезультатЗакрытия.Период.ДатаНачала);
		//Запрос.УстановитьПараметр("ДатаОкончания", 		РезультатЗакрытия.Период.ДатаОкончания);
		//Запрос.УстановитьПараметр("ДатаОстатков", 		РезультатЗакрытия.Период.ДатаОкончания);//ТекущаяДата());
		
	КонецЕсли; 
	
	//Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	Запрос.УстановитьПараметр("ДатаОстатков", Новый Граница(Объект.Ссылка.МоментВремени(), ВидГраницы.Исключая));	
	//Иначе
	//	Запрос.УстановитьПараметр("ДатаОстатков", 		Объект.Дата);		
	//КонецЕсли;
	
	Запрос.УстановитьПараметр("ДатаОстатков", 		РезультатЗакрытия.Период.ДатаОкончания);	
	Запрос.УстановитьПараметр("СписокКатегорий", 	СписокНоменклатуры);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	
	Объект.Запасы.Загрузить(Запрос.Выполнить().Выгрузить());  	
	
КонецПроцедуры

Функция ТекстЗапросНЗП()

	ЗапросТекст = 
		"ВЫБРАТЬ
		|	алк_СборкаЗапасовСерийныеНомераПродукция.СерийныйНомер
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Документ.алк_СборкаЗапасов.СерийныеНомераПродукция КАК алк_СборкаЗапасовСерийныеНомераПродукция
		|ГДЕ
		|	алк_СборкаЗапасовСерийныеНомераПродукция.Ссылка.ДатаСмены = &ДатаСмены
		|	И алк_СборкаЗапасовСерийныеНомераПродукция.Ссылка.Смена = &Смена
		|	И алк_СборкаЗапасовСерийныеНомераПродукция.Ссылка.Проведен
		|	И алк_СборкаЗапасовСерийныеНомераПродукция.Ссылка.СтруктурнаяЕдиницаПродукции = &СтруктурнаяЕдиница
		|	И алк_СборкаЗапасовСерийныеНомераПродукция.Ссылка.Направление = &Направление
		|	И алк_СборкаЗапасовСерийныеНомераПродукция.СерийныйНомер.Наименование ПОДОБНО ""НЗ%""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.СерийныйНомер,
		|	алк_ПараметрыПакетовСрезПоследних.Характеристика,
		|	алк_ПараметрыПакетовСрезПоследних.Объем,
		|	алк_ПараметрыПакетовСрезПоследних.КоличествоСостав,
		|	алк_ПараметрыПакетовСрезПоследних.НомерПакета,
		|	алк_ПараметрыПакетовСрезПоследних.Характеристика.Владелец КАК Номенклатура,
		|	1 КАК КоличествоПакетов
		|ИЗ
		|	ВТ КАК ВТ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
		|				,
		|				СерийныйНомер В
		|					(ВЫБРАТЬ
		|						ВТ.СерийныйНомер
		|					ИЗ
		|						ВТ КАК ВТ)) КАК алк_ПараметрыПакетовСрезПоследних
		|		ПО ВТ.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер";
	
	Возврат ЗапросТекст;

	

КонецФункции // ТекстЗапросНЗП()

Функция ТекстЗапросЗаСмену()
	
	ЗапросТекст = 
		"ВЫБРАТЬ
		|	алк_СборкаЗапасовСерийныеНомераПродукция.СерийныйНомер
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Документ.алк_СборкаЗапасов.СерийныеНомераПродукция КАК алк_СборкаЗапасовСерийныеНомераПродукция
		|ГДЕ
		|	алк_СборкаЗапасовСерийныеНомераПродукция.Ссылка.ДатаСмены = &ДатаСмены
		|	И алк_СборкаЗапасовСерийныеНомераПродукция.Ссылка.Смена = &Смена
		|	И алк_СборкаЗапасовСерийныеНомераПродукция.Ссылка.Проведен
		|	И алк_СборкаЗапасовСерийныеНомераПродукция.Ссылка.СтруктурнаяЕдиницаПродукции = &СтруктурнаяЕдиница
		|	И алк_СборкаЗапасовСерийныеНомераПродукция.Ссылка.Направление = &Направление
		|	И НЕ алк_СборкаЗапасовСерийныеНомераПродукция.СерийныйНомер.Наименование ПОДОБНО ""НЗ%""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.СерийныйНомер,
		|	алк_ПараметрыПакетовСрезПоследних.Характеристика,
		|	алк_ПараметрыПакетовСрезПоследних.Объем,
		|	алк_ПараметрыПакетовСрезПоследних.КоличествоСостав,
		|	алк_ПараметрыПакетовСрезПоследних.НомерПакета,
		|	алк_ПараметрыПакетовСрезПоследних.Характеристика.Владелец КАК Номенклатура,
		|	1 КАК КоличествоПакетов
		|ИЗ
		|	ВТ КАК ВТ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
		|				,
		|				СерийныйНомер В
		|					(ВЫБРАТЬ
		|						ВТ.СерийныйНомер
		|					ИЗ
		|						ВТ КАК ВТ)) КАК алк_ПараметрыПакетовСрезПоследних
		|		ПО ВТ.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
		|ГДЕ
		|	алк_ПараметрыПакетовСрезПоследних.Характеристика.Владелец.КатегорияНоменклатуры В(&СписокКатегорий)";
	
	Возврат ЗапросТекст;

КонецФункции // ТекстЗапросЗаСмену()

 

// Процедура обработчик события команды ЗаполнитьПоОстаткам
//
&НаКлиенте
Процедура ЗаполнитьПоОстаткамНаСкладе(Команда)  
			
	ЗаполнитьОстаткамиНаСкладе();   
	 
	//Если Объект.Проведен Тогда
	//	Сообщить("Перед заполнение требуется отменить проведение документа!");
	//	Возврат;
	//КонецЕсли; 
	//
	//Если Модифицированность Тогда
	//	Сообщить("Перед заполнение требуется записать изменения документа!");
	//	Возврат;                                                         	
	//КонецЕсли; 
	//	
	//Если Объект.Запасы.Количество() > 0 Тогда
	//	Ответ = Неопределено;
	//	
	//	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПоОстаткамНаСкладеЗавершение", ЭтотОбъект), НСтр("ru = 'Табличная часть будет очищена! Продолжить выполнение операции?'"), РежимДиалогаВопрос.ДаНет, 0);
	//	Возврат; 
	//КонецЕсли;
	//
	//ОповещениеВыбораПериода = Новый ОписаниеОповещения("ЗаполнитьПоОстаткамНаСкладеНаСервере", ЭтаФорма); 
	//ОткрытьФорму("ОбщаяФорма.ЗаполнениеПериода",, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,ОповещениеВыбораПериода);
	//
	////ЗаполнитьПоОстаткамНаСкладеНаСервере(СписокНоменклатуры);
	//ПроверитьНаОтрицательныеПакеты();
	
КонецПроцедуры 


&НаСервере
Процедура ЗаполнитьОстаткамиНаСкладе()   
	
	Если НЕ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.алк_ВидыОперацийПеремещениеЗапасов.ПередачаВНезавершенноеПроизводство")
		И НЕ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.алк_ВидыОперацийПеремещениеЗапасов.ПередачаСНезавершенногоПроизводства") Тогда
		БезНЗ = Истина;
	Иначе
		БезНЗ = Ложь;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ОстаткиЗапасовОстатки.Номенклатура,
		|	алк_ОстаткиЗапасовОстатки.СерийныйНомер,
		|	алк_ОстаткиЗапасовОстатки.Характеристика,
		|	алк_ОстаткиЗапасовОстатки.Сертификат,
		|	алк_ОстаткиЗапасовОстатки.КоличествоОстаток КАК Объем
		|ПОМЕСТИТЬ ВТ_Остатки
		|ИЗ
		|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
		|			&ДатаОстатков,
		|			Номенклатура.КатегорияНоменклатуры В (&Номенклатура)
		|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|				И Штабель = &Штабель
		|				И Организация = &Организация
		|				И НЕ СерийныйНомер = ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка)) КАК алк_ОстаткиЗапасовОстатки
		|ГДЕ
		|	алк_ОстаткиЗапасовОстатки.КоличествоОстаток > 0
		|	И (&БезНЗ
		|				И НЕ алк_ОстаткиЗапасовОстатки.СерийныйНомер.Наименование ПОДОБНО ""НЗ%""
		|			ИЛИ НЕ &БезНЗ
		|				И алк_ОстаткиЗапасовОстатки.СерийныйНомер.Наименование ПОДОБНО ""НЗ%"")
		|	И НЕ алк_ОстаткиЗапасовОстатки.СерийныйНомер В (&СерийныеНомераТЧ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Остатки.Номенклатура,
		|	ВТ_Остатки.СерийныйНомер,
		|	ВТ_Остатки.Характеристика,
		|	ВТ_Остатки.Сертификат,
		|	ВТ_Остатки.Объем,
		|	ВЫБОР
		|		КОГДА алк_ПараметрыХарактеристик.Объем = 0
		|			ТОГДА 0
		|		ИНАЧЕ ОКР(ВТ_Остатки.Объем / алк_ПараметрыХарактеристик.Объем, 0)
		|	КОНЕЦ КАК КоличествоСостав,
		|	1 КАК КоличествоПакетов
		|ИЗ
		|	ВТ_Остатки КАК ВТ_Остатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
		|		ПО ВТ_Остатки.Характеристика = алк_ПараметрыХарактеристик.Характеристика";
	
	Если ЗначениеЗаполнено(Объект.ДатаСмены) И ЗначениеЗаполнено(Объект.Смена) Тогда
		ДатаОстатков = РфпСервер.ПолучитьДатуВремяНачалоКонецСмены(Объект.Смена,Объект.ДатаСмены).ДатаВремяКонцаСмены;
	Иначе
		Если НЕ ЗначениеЗаполнено(Объект.Участок) Тогда 
			Сообщить("Укажите участок перед заполнением!");
			Возврат;
		КонецЕсли;
		
		ПараметрыСмены = РфпПолучениеДанныхСервер.ПолучитьПараметрыСменыПоДате(Объект.Участок, ТекущаяДата());  
		Если ПараметрыСмены = Неопределено Тогда 
			Возврат; //будет ошибка с текстом из рфп модуля
		КонецЕсли;
		
		ДатаОстатков = РфпСервер.ПолучитьДатуВремяНачалоКонецСмены(ПараметрыСмены.Смена,ПараметрыСмены.ДатаСмены).ДатаВремяКонцаСмены;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДатаОстатков", ДатаОстатков);
	Запрос.УстановитьПараметр("Номенклатура", СписокНоменклатуры.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Штабель", Объект.Штабель); 
	Запрос.УстановитьПараметр("БезНЗ", БезНЗ); 
	Запрос.УстановитьПараметр("СерийныеНомераТЧ",Объект.Запасы.Выгрузить(,"СерийныйНомер").ВыгрузитьКолонку("СерийныйНомер"));
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		
		НоваяСтр = Объект.Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтр, ВыборкаДетальныеЗаписи);	
		
	КонецЦикла; 

КонецПроцедуры


&НаКлиенте
Процедура ПроверитьНаОтрицательныеПакеты()
	Для Каждого Стр Из Объект.Запасы Цикл
		Если Стр.КоличествоПакетов < 0 Тогда
			Сообщить("Пакет " + Стр.СерийныйНомер + " имеет отрицательный остаток. Проверьте его выпуск");		
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОстаткамНаСкладеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Ответ = Результат;
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;   
	
	Если ДополнительныеПараметры = "ОстакамиПриемкиНаСГП" Тогда
		
		ОповещениеВыбораПериода = Новый ОписаниеОповещения("ЗаполнитьПоОстаткамНаПриемкеСГП", ЭтаФорма); 
		ОткрытьФорму("ОбщаяФорма.ЗаполнениеПериода",, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,ОповещениеВыбораПериода);
		
	Иначе   
		
		ОповещениеВыбораПериода = Новый ОписаниеОповещения("ЗаполнитьПоОстаткамНаСкладеНаСервере", ЭтаФорма); 
		ОткрытьФорму("ОбщаяФорма.ЗаполнениеПериода",, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,ОповещениеВыбораПериода); 
		
	КонецЕсли;	
	
	//ЗаполнитьПоОстаткамНаСкладеНаСервере(СписокНоменклатуры);
	ПроверитьНаОтрицательныеПакеты();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОстаткамНаСушкеНаСервере(СписокНоменклатуры, ТолькоСухие)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПакетыВСушильныхКамерахОбороты.СерийныйНомер,
		|	алк_ПакетыВСушильныхКамерахОбороты.КоличествоПриход
		|ПОМЕСТИТЬ ВТ_ПакетыВКамерах
		|ИЗ
		|	РегистрНакопления.алк_ПакетыВСушильныхКамерах.Обороты(&ДатаОстатков, , , ) КАК алк_ПакетыВСушильныхКамерахОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ЗапасыНаСкладахСерииОстатки.Номенклатура,
		|	алк_ЗапасыНаСкладахСерииОстатки.СерийныйНомер,
		|	алк_ЗапасыНаСкладахСерииОстатки.КоличествоПакетовОстаток КАК КоличествоПакетов
		|ПОМЕСТИТЬ ВТ_Остатки
		|ИЗ
		|	РегистрНакопления.алк_ЗапасыНаСкладахСерии.Остатки(
		|			&ДатаОстатков,
		|			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|				И Ячейка = &Ячейка
		|				И Номенклатура.КатегорияНоменклатуры В (&СписокНоменклатуры)) КАК алк_ЗапасыНаСкладахСерииОстатки
		|ГДЕ
		|	алк_ЗапасыНаСкладахСерииОстатки.КоличествоПакетовОстаток > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Остатки.Номенклатура,
		|	ВТ_Остатки.СерийныйНомер,
		|	ВТ_Остатки.КоличествоПакетов,
		|	алк_ПараметрыПакетовСрезПоследних.Характеристика,
		|	алк_ПараметрыПакетовСрезПоследних.Сухой
		|ПОМЕСТИТЬ ВТ_ПакетыСХарактеристикой
		|ИЗ
		|	ВТ_Остатки КАК ВТ_Остатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
		|				&ДатаОстатков,
		|				СерийныйНомер В
		|					(ВЫБРАТЬ
		|						ВТ_Остатки.СерийныйНомер
		|					ИЗ
		|						ВТ_Остатки КАК ВТ_Остатки)) КАК алк_ПараметрыПакетовСрезПоследних
		|		ПО ВТ_Остатки.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
		|ГДЕ
		|	ВТ_Остатки.КоличествоПакетов > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПакетыСХарактеристикой.Номенклатура,
		|	ВТ_ПакетыСХарактеристикой.СерийныйНомер,
		|	ВТ_ПакетыСХарактеристикой.Характеристика,
		|	1 КАК КоличествоПакетов
		|ИЗ
		|	ВТ_ПакетыСХарактеристикой КАК ВТ_ПакетыСХарактеристикой
		|ГДЕ
		|	ВТ_ПакетыСХарактеристикой.КоличествоПакетов > 0
		|	И ВТ_ПакетыСХарактеристикой.Сухой = &Сухой";
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Запрос.УстановитьПараметр("ДатаОстатков", Новый Граница(Объект.Ссылка.МоментВремени(), ВидГраницы.Исключая));	
	Иначе
		Запрос.УстановитьПараметр("ДатаОстатков", 		Объект.Дата);		
	КонецЕсли;
	
	//Запрос.УстановитьПараметр("ИсключитьПакетыВКамерах",	ИсключитьПакетыВКамерах);
	Запрос.УстановитьПараметр("СписокНоменклатуры",			СписокНоменклатуры);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", 		Объект.СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Ячейка", 					Справочники.Ячейки.ПустаяСсылка());  // должно быть пустым, т.к. нам нужны только те пакеты что не в сушильной камере.
	
	Если ТолькоСухие  Тогда
		Запрос.УстановитьПараметр("Сухой", Истина);
	ИначеЕсли ТолькоСырые Тогда
		Запрос.УстановитьПараметр("Сухой", Ложь);
	Иначе
	    Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТ_ПакетыСХарактеристикой.Сухой = &Сухой", "1=1");
	КонецЕсли;                         
		
	Объект.Запасы.Загрузить(Запрос.Выполнить().Выгрузить());
	 
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОстаткамНаСушкеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Ответ = Результат;
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли; 
	
	ЗаполнитьПоОстаткамНаСушкеНаСервере(СписокНоменклатуры, ТолькоСухие);
	ПроверитьНаОтрицательныеПакеты();
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьПоОстаткамНаСушке(Команда)
	
	Если Объект.Проведен Тогда
		Сообщить("Перед заполнение требуется отменить проведение документа!");
		Возврат;
	КонецЕсли; 
	
	Если Модифицированность Тогда
		Сообщить("Перед заполнение требуется записать изменения документа!");
		Возврат;                                                         	
	КонецЕсли; 
	
	Если Не Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.алк_ВидыОперацийПеремещениеЗапасов.ПередачаССушки") Тогда
		Сообщить("Для заполнения остаткими ЦЛП требуется выбрать вид операции ""Передача с сушки"" и записать документ!");
		Возврат;
	КонецЕсли; 

	
	Если Объект.Запасы.Количество() > 0 Тогда
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПоОстаткамНаСушкеЗавершение", ЭтотОбъект), НСтр("ru = 'Табличная часть будет очищена! Продолжить выполнение операции?'"), РежимДиалогаВопрос.ДаНет, 0);
		Возврат; 
	КонецЕсли;
	
	ЗаполнитьПоОстаткамНаСушкеНаСервере(СписокНоменклатуры, ТолькоСухие);
	ПроверитьНаОтрицательныеПакеты();
	
КонецПроцедуры

#КонецОбласти


#Область ОбщегоНазначения

&НаКлиенте
Функция НеСоответствующиеСпискуВидов(СписокЛишних)
	
	МассивЛишнихСтрок = Новый Массив;
	Для каждого стрЗапасы Из Объект.Запасы Цикл
		Если СписокЛишних.НайтиПоЗначению(стрЗапасы.Номенклатура) <> Неопределено Тогда
			МассивЛишнихСтрок.Добавить(стрЗапасы);	
		КонецЕсли; 	
	КонецЦикла; 
	Возврат МассивЛишнихСтрок;
	
КонецФункции

&НаКлиенте
Процедура СинхронизироватьСписокИТаблицу()	
	
	Объект.ВидыНоменклатуры.Очистить();
	Для каждого элт Из СписокНоменклатуры Цикл
		НовСтр = Объект.ВидыНоменклатуры.Добавить();
		НовСтр.ВидНоменклатуры = элт.Значение;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Копирование Тогда
		Возврат;	
	КонецЕсли;
	
	Если НоваяСтрока Тогда
		ТекДанные =	Элемент.ТекущиеДанные;
		Если Не Множественность Тогда
			ТекДанные.Номенклатура = РфпПолучениеДанныхСервер.ОсновнаяНоменклатураКатегории(СписокНоменклатуры[0].Значение);	
		КонецЕсли;
	Иначе
		
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти


#Область КоммандныйИнтерфейс

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект)
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыСерийныйНомерПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

//Дубоделов Э.А 07.06.2023 Обр. 0000171009
//Добавил изменение операции и склада при изменении направления
&НаКлиенте
Процедура НаправлениеПриИзменении(Элемент)
	
	Элементы.ЗапасыЗаполнитьПоОстаткамНаСкладе.Видимость = Объект.Направление <> ПредопределенноеЗначение("Перечисление.алк_НаправленияДеятельности.ДревесныеГранулы");
	
	//Дубоделов Э.А
	ВидОперацииПриИзмененииНаСервере();
	Объект.Запасы.Очистить();
	//Дубоделов Э.А
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДааныеПакетовНаСервере()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПеремещениеЗапасовЗапасы.НомерСтроки,
		|	алк_ПеремещениеЗапасовЗапасы.Номенклатура,
		|	алк_ПеремещениеЗапасовЗапасы.СерийныйНомер,
		|	алк_ПеремещениеЗапасовЗапасы.СерийныеНомера,
		|	алк_ПеремещениеЗапасовЗапасы.Характеристика,
		|	алк_ПеремещениеЗапасовЗапасы.КлючСвязи,
		|	алк_ПеремещениеЗапасовЗапасы.КоличествоПакетов,
		|	алк_ПеремещениеЗапасовЗапасы.НомерСерии,
		|	алк_ПеремещениеЗапасовЗапасы.Идентифицирован,
		|	алк_ПеремещениеЗапасовЗапасы.ПериодПакетаГод
		|ПОМЕСТИТЬ ВТ_Пакеты
		|ИЗ
		|	Документ.алк_ПеремещениеЗапасов.Запасы КАК алк_ПеремещениеЗапасовЗапасы
		|ГДЕ
		|	алк_ПеремещениеЗапасовЗапасы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Пакеты.НомерСтроки КАК НомерСтроки,
		|	ВТ_Пакеты.Номенклатура,
		|	ВТ_Пакеты.СерийныйНомер,
		|	ВТ_Пакеты.СерийныеНомера,
		|	алк_ПараметрыПакетовСрезПоследних.Характеристика,
		|	ВТ_Пакеты.КлючСвязи,
		|	ВТ_Пакеты.КоличествоПакетов,
		|	ВТ_Пакеты.НомерСерии,
		|	ВТ_Пакеты.Идентифицирован,
		|	ВТ_Пакеты.ПериодПакетаГод,
		|	алк_ПараметрыПакетовСрезПоследних.КоличествоСостав,
		|	алк_ПараметрыПакетовСрезПоследних.Объем
		|ИЗ
		|	ВТ_Пакеты КАК ВТ_Пакеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
		|				&ДатаСреза,
		|				СерийныйНомер В
		|					(ВЫБРАТЬ
		|						ВТ_Пакеты.СерийныйНомер
		|					ИЗ
		|						ВТ_Пакеты КАК ВТ_Пакеты)) КАК алк_ПараметрыПакетовСрезПоследних
		|		ПО ВТ_Пакеты.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	
	Запрос.УстановитьПараметр("ДатаСреза", КонецДня(Объект.ДатаСмены));
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Объект.Запасы.Загрузить(Запрос.Выполнить().Выгрузить());
	                    	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДааныеПакетов(Команда)
	
	Если Модифицированность Тогда
		Сообщить("Перед обновлением данных документ нужно записать!");   
		Возврат;
	КонецЕсли; 
	
	ОбновитьДааныеПакетовНаСервере();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОстаткамиЗаПериод(Команда)
	
	Если Объект.Проведен Тогда
		Сообщить("Перед заполнение требуется отменить проведение документа!");
		Возврат;
	КонецЕсли; 
	
	Если Модифицированность Тогда
		Сообщить("Перед заполнение требуется записать изменения документа!");
		Возврат;                                                         	
	КонецЕсли; 
		
	Если Объект.Запасы.Количество() > 0 Тогда	
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьОстаткамиЗаПериодЗавершение", ЭтотОбъект), НСтр("ru = 'Табличная часть будет очищена! Продолжить выполнение операции?'"), РежимДиалогаВопрос.ДаНет, 0);
		Возврат; 
	КонецЕсли;
	
	ЗаполнитьОстаткамиЗаПериодКлиент();
	ПроверитьНаОтрицательныеПакеты();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОстаткамиЗаПериодЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Ответ = Результат;
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли; 
	
	ЗаполнитьОстаткамиЗаПериодКлиент();
	ПроверитьНаОтрицательныеПакеты();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОстаткамиЗаПериодКлиент()
	
	ОповещениеВыбораПериода = Новый ОписаниеОповещения("ЗаполнитьОстаткамиЗаПериодНаСервере", ЭтаФорма); 
    ОткрытьФорму("ОбщаяФорма.ЗаполнениеПериода",, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,ОповещениеВыбораПериода);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОстаткамиЗаПериодНаСервере(РезультатЗакрытия, ДопПараметры) Экспорт	
	
	//Когда закрыли окно с периодом, нажав на крестик
	Если РезультатЗакрытия = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
				
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ЗапасыНаСкладахСерииОбороты.СерийныйНомер
		|ПОМЕСТИТЬ втОборотЗапериод
		|ИЗ
		|	РегистрНакопления.алк_ЗапасыНаСкладахСерии.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			,
		|			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|				И Штабель = &Штабель) КАК алк_ЗапасыНаСкладахСерииОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	алк_ЗапасыНаСкладахСерииОбороты.СерийныйНомер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	алк_ЗапасыНаСкладахСерииОстатки.Номенклатура,
		|	алк_ЗапасыНаСкладахСерииОстатки.СерийныйНомер КАК СерийныйНомер,
		|	алк_ЗапасыНаСкладахСерииОстатки.КоличествоПакетовОстаток КАК КоличествоПакетов
		|ПОМЕСТИТЬ втОстатки
		|ИЗ
		|	РегистрНакопления.алк_ЗапасыНаСкладахСерии.Остатки(
		|			&ДатаОстатков,
		|			СерийныйНомер В
		|					(ВЫБРАТЬ
		|						втОборотЗапериод.СерийныйНомер
		|					ИЗ
		|						втОборотЗапериод КАК втОборотЗапериод)
		|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|				И Штабель = &Штабель) КАК алк_ЗапасыНаСкладахСерииОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Номенклатура,
		|	ВТ.СерийныйНомер,
		|	ВТ.КоличествоПакетов,
		|	алк_ПараметрыПакетовСрезПоследних.Характеристика,
		|	алк_ПараметрыПакетовСрезПоследних.КоличествоСостав,
		|	алк_ПараметрыПакетовСрезПоследних.Объем
		|ИЗ
		|	втОстатки КАК ВТ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
		|				&ДатаОстатков,
		|				СерийныйНомер В
		|					(ВЫБРАТЬ
		|						втОстатки.СерийныйНомер
		|					ИЗ
		|						втОстатки КАК втОстатки)) КАК алк_ПараметрыПакетовСрезПоследних
		|		ПО ВТ.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер";
			
	Запрос.УстановитьПараметр("ДатаНачала", 		РезультатЗакрытия.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 		РезультатЗакрытия.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ДатаОстатков", 		РезультатЗакрытия.Период.ДатаОкончания);//ТекущаяДата());
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Штабель", Объект.Штабель);
	
	Объект.Запасы.Загрузить(Запрос.Выполнить().Выгрузить());  	
	
КонецПроцедуры

&НаСервере
Процедура УчастокПриИзмененииНаСервере()
	Элементы.Смена.ПараметрыВыбора = РфпСервер.ПолучитьОтборПоТипуСмены(Объект.Участок, Объект.ДатаСмены);
КонецПроцедуры

&НаКлиенте
Процедура УчастокПриИзменении(Элемент)
	УчастокПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОстакамиПриемкиНаСГП(Команда) 
	
	Если Объект.Проведен Тогда
		Сообщить("Перед заполнение требуется отменить проведение документа!");
		Возврат;
	КонецЕсли; 
	
	Если Модифицированность Тогда
		Сообщить("Перед заполнение требуется записать изменения документа!");
		Возврат;                                                         	
	КонецЕсли; 
		
	Если Объект.Запасы.Количество() > 0 Тогда
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПоОстаткамНаСкладеЗавершение", ЭтотОбъект, "ОстакамиПриемкиНаСГП"), НСтр("ru = 'Табличная часть будет очищена! Продолжить выполнение операции?'"), РежимДиалогаВопрос.ДаНет, 0);
		Возврат; 
	КонецЕсли;
	
	ОповещениеВыбораПериода = Новый ОписаниеОповещения("ЗаполнитьПоОстаткамНаПриемкеСГП", ЭтаФорма); 
    ОткрытьФорму("ОбщаяФорма.ЗаполнениеПериода",, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,ОповещениеВыбораПериода);
	
	//ЗаполнитьПоОстаткамНаСкладеНаСервере(СписокНоменклатуры);
	ПроверитьНаОтрицательныеПакеты(); 

КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьПоОстаткамНаПриемкеСГП(РезультатЗакрытия, ДопПараметры) Экспорт    
	
	//Когда закрыли окно с периодом, нажав на крестик
	Если РезультатЗакрытия = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;   
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_ОстаткиЗапасовОстатки.Номенклатура,
	|	алк_ОстаткиЗапасовОстатки.СерийныйНомер,
	|	1 КАК КоличествоПакетов,
	|	алк_ОстаткиЗапасовОстатки.Характеристика,
	|	ВЫРАЗИТЬ(алк_ОстаткиЗапасовОстатки.КоличествоОстаток / алк_ПараметрыХарактеристик.Объем КАК ЧИСЛО(15, 0)) КАК КоличествоСостав,
	|	алк_ОстаткиЗапасовОстатки.КоличествоОстаток КАК Объем
	|ИЗ
	|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(
	|			&ДатаОстатков,
	|			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|				И Номенклатура.КатегорияНоменклатуры В (&СписокКатегорий)
	|				И Штабель = &Штабель) КАК алк_ОстаткиЗапасовОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|		ПО алк_ОстаткиЗапасовОстатки.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|ГДЕ
	|	алк_ОстаткиЗапасовОстатки.КоличествоОстаток > 0";
	
	
	Запрос.УстановитьПараметр("ДатаОстатков", 		РезультатЗакрытия.Период.ДатаОкончания);	
	Запрос.УстановитьПараметр("СписокКатегорий", 	СписокНоменклатуры);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница); 
	Запрос.УстановитьПараметр("Штабель", 			Объект.Штабель);
	
	
	Объект.Запасы.Загрузить(Запрос.Выполнить().Выгрузить());  	
	
КонецПроцедуры



#КонецОбласти
